import Image1 from './images/image1.jpg';
import Image2 from './images/image2.jpg';
import Image3 from './images/image3.jpg';
import Image4 from './images/image4.jpg';
import Image5 from './images/image5.jpg';
import Image6 from './images/image6.jpg';
import Image7 from './images/image7.jpg';
import Image8 from './images/image8.jpg';
import Image9 from './images/image9.jpg';
import Image10 from './images/image10.jpg';


const structures = [
    {
        img: Image1,
        title: "Человек паук, 7.8", 
        description: [
            `Питер Паркер — обыкновенный школьник.
            Однажды он отправился с классом на
            экскурсию, где его кусает странный паук-мутант.
            Через время парень почувствовал в себе
            нечеловеческую силу и ловкость в движении, а
            главное — умение лазать по стенам и метать стальную паутину. Свои способности он направляет на защиту слабых. Так Питер становится настоящим супергероем по имени
            Человек-паук, который помогает людям и борется с преступностью. Но там, где есть супергерой, рано или поздно всегда`
        ],
    },   
    {
        img: Image2,
        title: `Новый человек паук, 6.9`, 
        description: [
            `В детстве Питер Паркер был оставлен своими
            родителями, и поэтому воспитывался дядей и
            тётей. Шли годы, Питер был обычным
            примерным школьником, подвергался нападкам
            хулиганов и был влюблён в свою одноклассницу
            Гвен Стейси, которая сама втайне отвечала ему
            взаимностью. Но после укуса генетически
            изменённого паука, Питер получает
            невероятные сверхспособности и его жизнь
            меняется навсегда. Однако его не перестаёт
            мучить вопрос о том, что случилось с его
            родителями. Он знакомится с давним другом и
            партнёром своего отца - генетиком Куртом
            Коннорсом, который вместе с отцом Питера
            разрабатывал формулу регенерации. Питер
            помогает её закончить, а Коннорс, всю жизнь…`
        ]
    },
    {
        img: Image3, 
        title: "Новый Человек-паук: Высокое напряжение, 6.7", 
        description: [
            `Питер Паркер по-прежнему стоит на страже Нью-Йорка: действуя в образе Человека-паука, он борется со злом во всех его проявлениях, а в свободное от «работы» время отрывается со своей подружкой Гвен. Однако они уже не дети — скоро парочке предстоит выпуститься из школы и начать взрослую жизнь. Питера терзает обещание, данное отцу Гвен: 
            он поклялся, что оставит девушку в покое, чтобы не подвергать её жизнь угрозе.
            Однако верно утверждают, что сказать легко, а сделать сложно, и в вопросах любви это справедливо как никогда. Питер отчаянно пытается исполнить свой долг, но именно 
            в этот момент возвращается старый враг... в новом обличье.
            Год выпуска: 2014
            Жанр: фантастика, боевик, приключения
            Продолжительность: 142 мин.
            Режиссёр: Марк Уэбб
            В ролях: Эндрю Гарфилд, Эмма Стоун, Джейми Фокс, Дэйн ДеХаан, Салли Филд, Колм Фиор, Фелисити Джонс, Пол Джаматти, Мартон Чокаш, Кэмпбелл Скотт
            Cтрана: США
            Cтудия: Columbia Pictures, Avi Arad Productions, South Australian Film Corporation`
            ]
    },
    {
        img: Image4,
        title: 'Звёздные войны: Эпизод 1 — Скрытая угроза, 7.9',
        description: [
            `Мирная и процветающая планета Набу. Торговая федерация, не желая платить налоги, вступает в прямой конфликт с королевой Амидалой, правящей на планете, что приводит к войне. На стороне королевы и республики в ней участвуют два рыцаря-джедая: учитель и ученик, Квай-Гон-Джин и Оби-Ван Кеноби...`
        ] 
    },
    {
        img: Image5,
        title: "Барби, 6.6",  
        description: [
             `Действие комедии Барби разворачивается в сказочном Барбиленде. В городе проживают разные виды Барби, Кенов и других кукол производителя Mattel, снятых с конвейера из-за их нестандартных особенностей.`,
            `Главная героиня и её ухажёр «пляжный» Кен из мира Барби отправляются в совместное путешествие в реальный мир: всё потому, что Барби жаждет найти ту девочку, которая играет с ней.`,
            `Предпосылкой к этому стало внезапное беспокойство героини о мимолётности её жизни и мысли о смерти. Совместное знакомство с реальным миром открывает героям глаза на существующие в жизни стереотипы, экзистенциальный кризис взрослых людей и влияние патриархата на современность.`,
            `Героям предстоит найти себя и потрудиться на благо построения своего общества, выбора жизненных целей и взаимопонимания между всеми куклами, населяющими Барбиленд.`,
            `Год выпуска: 2023
            Жанр: комедия, фентези, приключения
            Продолжительность: 114 минут`
        ]
    },
    {
        img: Image6,
        title: "Батя 2. Дед, 7.6",  
        description: [
            `Во время развода с женой Макс вспоминает детство, когда родители, которые тоже собирались разводиться, 
            отправили его на лето к деду-фронтовику в деревню. Тогда строгий дед стал настоящим другом и учителем для мальчика, а также свидетелем и участником его
            многочисленных проделок.`
        ]
    },
    {
        img: Image7,
        title: 'Оно, 5.6',
        description: [
            `Психотерапевт Синтия Уинстоун обладает уникальным даром проникать в чужое подсознание. 
            Однажды на пороге её дома появляется перепуганная 14-летняя Райли с просьбой спасти её от злобной сущности...`  
        ] 
    },
    {
        img: Image8,
        title: 'В потерянных землях, 5.3',
        description: [
            `После гибели техногенной цивилизации в мир вернулись магия и монстры. 
            По тайному заданию королевы ведьма Серая Элис отправляется из последнего города 
            Земли в опасные Потерянные земли. Вместе с проводником Бойсом ей предстоит до полной 
            Луны найти источник силы, что может обращать человека в зверя. Путников преследует 
            безжалостная армия крестоносцев, а за каждым поворотом поджидают порождения тьмы.`
        ]
    },
    {
        img: Image9,
        title: 'Алиса в Стране чудес, 7.1',
        description: [
            `В жизни 19-летней Алисы наступил беспросветно скучный период. На приёме, устроенном в её честь, руки и сердца Алисы просит состоятельный наследник, не вызывающий у девушки никакого интереса. Вместо ответа без пяти минут невеста сбегает с вечеринки и следует за замеченным ранее кроликом, который, как ни странно, носит камзол.
            У Алисы не получается догнать загадочную зверюшку: кролик исчезает в норе. Затем происходит ещё более удивительное событие — Алиса и сама падает в нору, которая оказывается туннелем, ведущим неизвестно куда. Миновав череду разнообразных препятствий, девушка попадает в сказочную страну.

            Год выпуска: 2010
            Жанр: детектив, приключения, фэнтези, семейный
            Продолжительность: 108 мин.`
        ]
    },
    {
        img: Image10,
        title: 'Индиана Джонс, 8.0',
        description: [
            `Вы соскучились по хорошему сочному боевику? Пора включать совместное творение Спилберга-Лукаса! 
            Господин Индиана Джонс – настоящий рыцарь новой эпохи. Формально он принадлежит к миру ученых, 
            но никто не знает, что от ботаников в очках его отличает не только авантюрный склад характера. 
            Доктор Джонс выполняет секретное особо важное правительственное поручение. 
            Он должен спасти мир от печальной участи, которую готовят жителям земли злобные фашистские твари. 
            И будьте уверены – он справится с миссией, даже если придется пожертвовать жизнью. Тем более, 
            что мужественному герою помогает неотразимая женщина (заметим – влюбленная, как кошка). 
            При таком раскладе у злодеев просто не остается шансов, и мы хотим видеть, как благородный ученый победит. Включай скорей!`
            
        ]  
    },
 
];

export default structures;